blog/app/controllers/articles_controller.rb

    def index
      @article = Article.paginate(page: params[:page], per_page:2 ).publicados.ultimos #Esto viene del modelo!
---
SELECT "articles".* FROM "articles"

    def show
      @article.update_visits_count #Esto es para ir aumentando en uno las visitas! - revisar article.rb
---
UPDATE "articles" SET "visits_count" = ?, "updated_at" = ?, "state" = ? WHERE "articles"."id" = ?  [["visits_count", 7], ["updated_at", "2021-08-31 16:52:57.959890"], ["state", "in_draft"], ["id", 10]]

    def update
      #@article = Article.find(params[:id])
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Primer Articulo Actualizado"], ["updated_at", "2021-08-25 00:19:48.550274"], ["id", 1]]

    def create
      @article = current_user.articles.new(article_params)
      @article.categories = params[:categories]
      if @article.save #Si pasaron las validaciones, redirecciona, sinó, nos devuelve.
        redirect_to @article
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "NUevo post"], ["body", "NUevo post"], ["created_at", "2021-08-24 18:14:31.816601"], ["updated_at", "2021-08-24 18:14:31.816601"]]
INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 10], ["category_id", 1], ["created_at", "2021-08-27 00:25:34.209844"], ["updated_at", "2021-08-27 00:25:34.209844"]]