blog/app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Libros"], ["color", "#77ff61"], ["created_at", "2021-08-26 21:19:08.878503"], ["updated_at", "2021-08-26 21:19:08.878503"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save