blog/app/controllers/comments_controller.rb

  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article
    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_id", "article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["article_id", 7], ["body", "Comentario enviado por ajax"], ["created_at", "2021-08-26 02:36:34.824810"], ["updated_at", "2021-08-26 02:36:34.824810"]]

  def update
    respond_to do |format|
      if @comment.update(comment_params)
---
UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "buen articulo"], ["updated_at", "2021-08-25 21:23:12.924588"], ["id", 1]]