blog/app/models/article.rb

UPDATE "articles" SET "visits_count" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["visits_count", 3], ["updated_at", "2021-09-03 22:44:42.134473"], ["id", 11]]
---
    def update_visits_count
        self.update(visits_count: self.visits_count + 1)

INSERT INTO "has_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 12], ["category_id", 1], ["created_at", "2021-08-28 13:52:26.502408"], ["updated_at", "2021-08-28 13:52:26.502408"]]
---
    def save_categories
        @categories.each do |category_id|
            HasCategory.create(category_id: category_id, article_id: self.id)